# WSScript_SetResInt

## Description
This function must be used inside a worksheet script called by 'RunScript' worksheet formula.&lt;BR&gt;
&lt;BR&gt;
Set the result of the worksheet script to the integer value specified.

```pascal
PROCEDURE WSScript_SetResInt(resultCellValue : INTEGER);
```

```python

def vs.WSScript_SetResInt(resultCellValue):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|resultCellValue|INTEGER|The value for the result of the worksheet script called by the RunScript worksheet function.|

## See Also
VS Functions:
WSScript_GetObject| WSScript_GetPrmInt| WSScript_GetPrmReal| WSScript_GetPrmStr| WSScript_SetResStr| WSScript_SetResReal| WSScript_SetResImage

## Version
Availability: from Vectorworks 2016
## Category
* Worksheets